--- a/docs/bandmap_thread_confinement.md
+++ b/docs/bandmap_thread_confinement.md
@@ -1,373 +1,207 @@
 
 ## Add an entry coming from the DX cluster
 
-```plantuml
-@startuml
-SpotsController --> spotsView:EntryAdded
+```mermaid
+sequenceDiagram
+SpotsController ->> spotsView:EntryAdded
 
-spotsView --> spotsView:runAsync
+spotsView ->> spotsView:runAsync
 activate spotsView
-group later in the UI
-    spotsView --> spotsTableView:addTableEntry
+critical [later in the UI]
+    spotsView ->> spotsTableView:addTableEntry
 
-    spotsTableView --> gtk.ListStore:Insert
-    spotsTableView --> spotsTableView:fillEntryToTableRow
-    spotsTableView --> gtk.ListStore:Set
+    spotsTableView ->> gtk.ListStore:Insert
+    spotsTableView ->> spotsTableView:fillEntryToTableRow
+    spotsTableView ->> gtk.ListStore:Set
 end
 deactivate spotsView
-@enduml
 ```
 
 ## Update an existing table entry due to changes coming from the DX cluster
 
-```plantuml
-@startuml
-SpotsController --> spotsView:EntryUpdated
+```mermaid
+sequenceDiagram
+SpotsController ->> spotsView:EntryUpdated
 
-spotsView --> spotsView:runAsync
+spotsView ->> spotsView:runAsync
 activate spotsView
-group later in the UI
-    spotsView --> spotsTableView:updateTableEntry
+critical [later in the UI]
+    spotsView ->> spotsTableView:updateTableEntry
 
-    spotsTableView --> spotsTableView:tableRowByIndex
-    spotsTableView --> gtk.ListStore:GetIterFromString
-    spotsTableView --> spotsTableView:fillEntryToTableRow
-    spotsTableView --> gtk.ListStore:Set
+    spotsTableView ->> spotsTableView:tableRowByIndex
+    spotsTableView ->> gtk.ListStore:GetIterFromString
+    spotsTableView ->> spotsTableView:fillEntryToTableRow
+    spotsTableView ->> gtk.ListStore:Set
 end
 deactivate spotsView
-@enduml
 ```
 
 ## Remove a stale table entry
 
-```plantuml
-@startuml
-SpotsController --> spotsView:EntryRemoved
+```mermaid
+sequenceDiagram
+SpotsController ->> spotsView:EntryRemoved
 
-spotsView --> spotsView:runAsync
+spotsView ->> spotsView:runAsync
 activate spotsView
-group later in the UI
-    spotsView --> spotsTableView:removeTableEntry
+critical [later in the UI]
+    spotsView ->> spotsTableView:removeTableEntry
 
-    spotsTableView --> spotsTableView:tableRowByIndex
-    spotsTableView --> gtk.ListStore:GetIterFromString
-    spotsTableView --> gtk.ListStore:Remove
+    spotsTableView ->> spotsTableView:tableRowByIndex
+    spotsTableView ->> gtk.ListStore:GetIterFromString
+    spotsTableView ->> gtk.ListStore:Remove
 end
 deactivate spotsView
-@enduml
 ```
 
 ## Reveal an entry
 
